#+TITLE: se nesesitan calculadoras en python que calculen el infierno
#+SUBTITLE: algunas calculadoras
#+AUTHOR: jero98772
#+OPTIONS:    H:3 num:nil toc:nil
#+INFOJS_OPT: view:t toc:t ltoc:t mouse:underline buttons:0y path:http://thomasf.github.io/solarized-css/org-info.min.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://bootswatch.com/4/lumen/bootstrap.min.css" />
** tomado todo de 
*** https://github.com/jero98772/calculadora
*** https://github.com/jero98772/DsoonMath 
**  con origen en 2015
**  evolcuion con 
*** https://github.com/jero98772/acua/blob/master/hw.py 
** luego evoluciono mas
***  https://github.com/jero98772/curapeces 
** hasta convertirse en 
*** https://github.com/jero98772/wwwofish 
** y de hay implementarlo a 
*** https://github.com/jero98772/webpage 
** en su continua evolucion
* version hello word con calculadoras
#+begin_src python
def suma(a,b):
    return a+b
def resta(a,b):
    return a-b
def mult(a,b):
    return a*b
def divR(a,b):
    return a/b
def divN(a,b):
    return a//b
def main():
    return suma(1,1), resta(1,2), mult(2,2),divR(2,3),divN(3,3)
return main()
#+end_src

#+RESULTS:
| 2 | -1 | 4 | 0.6666666666666666 | 1 |
* version no complejarse la vida  pero poner en peligro al mundo


